const realData = [
  {
    user: '中国气象局',
    content:
      '#秋风吹过# 【流感流行季节将至，收好这份应对指南[太阳]】流感病毒要早防，得了流感不能扛！10月起，流感病毒活动度逐渐增强，流感并不等于普通感冒，如何远离流感病毒呢？速速收好这份应对指南！[抱抱]',
    source: '新浪微博',
    like: '27',
    forward: '18',
    comment: '27'
  },
  {
    user: 'Sibel_lm',
    content:
      '两年没感冒了，小论文开始不到一个月就感冒了。即使这样，也还得敲代码。早睡早起身体好，然而我就是做不到[摊手]',
    source: '新浪微博',
    like: '0',
    forward: '0',
    comment: '0'
  },
  {
    user: '新浪娱乐',
    content:
      '#林俊杰的吊水针头被出售# 林俊杰26日在镇江开唱，网曝演唱会结束后他因为感冒前往医院挂吊瓶，事后疑有医护人员公然在网上售卖他使用过的针头和注水包。此前也有人卖艺人喝过的水瓶、在店内用餐时使用的餐具……#阿乐今日问#：你们会买偶像用过的此类东西吗？怎么看待这种行为？',
    source: '新浪微博',
    like: '152123',
    forward: '414',
    comment: '1246'
  },
  {
    user: 'Chloe-Carson',
    content:
      '今日我啦，弟弟啦，爸爸媽媽一齊去香港打流感疫苗，我冇喊，不過弟弟就喊得好勁啦',
    source: '新浪微博',
    like: '1',
    forward: '2',
    comment: '0'
  },
  {
    user: '央视财经',
    content:
      '【#流感疫苗最佳接种期#来了！专家：这6类人群该先打→】最近天气转凉，又到了每年流感高发期。多地出现#流感疫苗供不应求#。你打流感疫苗了吗？先别急着抢！接种流感疫苗可以有效预防流感，不过，在疫苗接种上，也有不少注意事项。专家介绍，每年的9到10月，是流感疫苗的最佳接种时间。有6类人群推荐优先接种：孕妇；6月龄以下婴儿的家庭成员和看护人员；6月龄到5岁儿童；60岁及以上老年人；一些特定慢性病患者；医务工作者。详戳↓  央视财经的酷燃视频',
    source: '新浪微博',
    like: '42',
    forward: '16',
    comment: '60'
  },
  {
    user: '联合早报',
    content:
      '【今日头条】最近天气阴晴不定是导致病例上升的原因之一，大家可要听医生的话，多喝水和多休息哦！ ',
    source: 'twitter',
    like: '1',
    forward: '0',
    comment: '0'
  },
  {
    user: 'TaiwanCDC',
    content:
      '今年公費流感疫苗首度由三價疫苗升級為四價疫苗，相信許多家長可能會疑惑，改為四價疫苗後小朋友該怎麼打？四價疫苗的劑型還有成人或小孩的分別嗎？讓疾小編占用你一點時間，為你一一解答吧！',
    source: 'twitter',
    like: '26',
    forward: '10',
    comment: '0'
  },
  {
    user: '舒肤佳Safeguard',
    content:
      '最近流感肆虐，又是诺如病毒的爆发期～小舒特意有请舒肤佳X壹基金洗手计划爱心大使@UNINE_李汶翰 给大家示范魔性洗手disco，“手”护健康！[心] 大家记得上各大电商平台搜索舒肤佳，跟着《一路成年》卫生委员旺旺，解锁健康守护新姿势哦！',
    source: '新浪微博',
    like: '1789',
    forward: '1306',
    comment: '1039'
  },
  {
    user: '丁香医生',
    content:
      '感冒的时候，大家可能都会选择吃点药。但实际上，感冒药并不可以治感冒，它只是改善发热、鼻塞等各种症状，让我们感觉更舒服，但并不会缩短我们感冒的病程。所以，「感冒吃药七天好，不吃药一个星期好」还是有一定道理的[允悲]。除此之外，还有一些关于感冒药的误区，大家有必要了解下。',
    source: '新浪微博',
    like: '523',
    forward: '295',
    comment: '273'
  },
  {
    user: 'FAIRYWANG',
    content:
      '最近流感什么的太严重了，TT已经发烧倒下，身边好多人都是接二连三被传染，大家一定要注意身体，出门记得戴口',
    source: '新浪微博',
    like: '3',
    forward: '41',
    comment: '34'
  },
  {
    user: '人民日报',
    content:
      '30日，国家卫健委举行新闻发布会，称我国即将进入流感流行季。据世界卫生组织，流感每年可导致5%-10%的成人和20%-30%的儿童发病，#全球每年约10亿人感染流感#。感染流感后，该如何治疗？接种流感疫苗需要注意什么？戳图了解↓↓关乎你我，转存！ ​',
    source: '新浪微博',
    like: '1751',
    forward: '3215',
    comment: '580'
  },
  {
    user: '绿色蒲江',
    content:
      '不同于普通感冒的流鼻涕、打喷嚏，流感是由流感病毒引起的急性呼吸道感染，症状为头痛、发热、全身乏力……65岁以上的老年人、婴幼儿、孕产妇以及慢性疾病患者要格外注意预防。流感可防可控，具体怎么操作 ​',
    source: '新浪微博',
    like: '14',
    forward: '24',
    comment: '15'
  },
  {
    user: '三思逍遥',
    content:
      '这次感冒有点厉害，虽然不发烧，可一直嗓子痛，上呼吸道难受，好在戒烟后，感冒也很少咳嗽了，否则就太受罪了。各位注意预防冬季感冒。 ​',
    source: '新浪微博',
    like: '14',
    forward: '24',
    comment: '15'
  },
  {
    user: '健康时报',
    content:
      '该死的流感又袭来，该如何预防和治疗？今年得过流感，是不是就不会再得了？多喝点板蓝根、抗病毒冲剂、熏醋可以预防流感不？哪些人可以打流感疫苗？为什么每年都要打？孕妇能不能打流感疫苗？……关于流感的这些问题，专家告诉你答案。 ​​',
    source: '新浪微博',
    like: '8',
    forward: '27',
    comment: '3'
  },
  {
    user: '健康时报',
    content:
      '【流感防控官宣来了！这些方案助你避开流感】气候转凉，流感高发季也即将来临。提起流感，很多人都心有余悸。那么如何有效预防流感？如果患流感应该如何治疗？国家卫生健康委员会发布流感防控核心信息。其中明确了流感和普通感冒的具体区别，同时提醒大家及时接种疫苗，如果患流感不倡导公众坚持工作​​',
    source: '新浪微博',
    like: '9',
    forward: '33',
    comment: '3'
  },
  {
    user: '四川药品监管',
    content:
      '【这条微博速转存！流感季来临】据世界卫生组织报告，流感每年可导致5%-10%的成人和20%-30%的儿童发病，全球约有10亿人感染流感。如何预防流感？得了流感有哪些症状？如何防止传染？预防流感必备知识↓转发提醒！ ​',
    source: '新浪微博',
    like: '0',
    forward: '1',
    comment: '3'
  },
  {
    user: '夏日的躁动',
    content:
      '这身体素质啊，又一次在冬天来临之前被流感击中了，嗓子难受吞咽困难，想咳嗽，很累想睡觉，可是夜晚又要到了，这一周每个夜晚又没睡好，心里总是很害怕，使劲安慰自己告诉自己怎样你不得睡啊，不管用啊，睡眠时间不够抵抗力也下降了吧',
    source: '新浪微博',
    like: '9',
    forward: '13',
    comment: '3'
  },
  {
    user: 'Mark D. Whitaker',
    content:
      '#STUDY: #Flu #Vaccine Associated w/ Spontaneous Abortion in #Pregnant Women #VaccineInjury https://t.co/1X0wY0P7St',
    source: '推特数据',
    like: '257',
    forward: '295',
    comment: '23'
  },
  {
    user: 'panda pundung',
    content:
      'Tentang pencegahan sakit flu di masa perubahan cuaca begini. Lebih baik antisipasi kan ya daripada sakit?',
    source: '推特数据',
    like: '0',
    forward: '0',
    comment: '5'
  },
  {
    user: 'andrea',
    content: 'did you get your flu shot? Also drink this and feel better',
    source: '推特数据',
    like: '2',
    forward: '10',
    comment: '0'
  },
  {
    user: 'Daily Flash TV',
    content:
      'Tackle Flu Season | RxSaver | DailyFlashTV https://t.co/47Ba6VFlBG',
    source: '推特数据',
    like: '15',
    forward: '10',
    comment: '0'
  },
  {
    user: 'Kristina',
    content:
      'Definitely a messed up system... If you were still looking for options for a free flu shot, hospitals sometimes run events for free flu shots. It\'s worth searching "free flu shots for the uninsured',
    source: '推特数据',
    like: '70',
    forward: '106',
    comment: '20'
  },
  {
    user: 'Haley Eyre',
    content:
      'Symptoms of flu include a high temperature, body aches and fatigue. If you think you have flu stay at home and rest until you feel better.  Call NHS 111 if you have an underlying health condition or feel really unwell.#helpushelpyou #staywellthiswinter',
    source: '推特数据',
    like: '68',
    forward: '127',
    comment: '18'
  }
];
const xData = [
  0.0025307968323223704,
  0.00235532659383753,
  0.005038617253516361,
  0.004275268371829756,
  0.002986535090732749,
  0.0042368749145211895,
  0.0027424113451732604,
  0.006073424091266417,
  0.005683276935501803,
  0.0027288312962793384,
  0.003367408615920748,
  0.002359630137076971,
  0.002560736655548584,
  0.0029668154350053887
];
const yData = [
  5.20633,
  4.04477,
  3.49722,
  2.69023,
  2.47119,
  2.44773,
  2.64594,
  2.61567,
  1.90712,
  1.89659,
  1.75181,
  1.52632,
  1.49572,
  1.22313,
  1.17754,
  1.09112,
  1.11958,
  1.08169,
  1.12497,
  1.86738,
  1.06197,
  1.08909,
  0.97493,
  0.987132,
  0.995991,
  0.904726,
  0.941927,
  0.880415,
  0.842615,
  1.88072,
  0.858382,
  0.83383,
  0.847437,
  0.888273,
  0.765372,
  0.91858,
  1.01432,
  1.01233,
  1.11803,
  1.11806,
  1.96908,
  1.10939,
  1.24341,
  1.25726,
  1.25734,
  1.43414,
  1.51838,
  1.61617,
  1.84378,
  1.72535,
  1.87923,
  2.11387,
  2.3371,
  3.03533,
  3.136,
  2.09695
];
const pdData = [
  2.35779333,
  2.7479732,
  2.26940465,
  2.83323956,
  3.052315,
  2.78366303,
  2.49047184,
  2.52783513,
  3.15843487,
  0.63706708,
  2.0622561,
  2.19327688,
  1.71348405,
  1.66272378,
  1.61477351,
  1.55892944,
  1.57407951,
  1.52432895,
  1.55115366,
  2.24031997,
  1.46506596,
  1.44333482,
  1.38500786,
  1.37180567,
  1.28707457,
  1.31615591,
  1.3351512,
  1.3715899,
  1.34339333,
  2.09763169,
  1.3212285,
  1.33025193,
  1.31250834,
  1.31241965,
  1.35012221,
  1.33995295,
  1.32277155,
  1.36851931,
  1.37366748,
  1.3960588,
  2.20135188,
  1.45910621,
  1.37568283,
  1.40927124,
  1.37065482,
  1.45839691,
  1.45727134,
  1.41596746,
  1.55256534,
  1.72616172,
  1.66385078,
  2.00728154,
  1.63937092,
  1.46428418,
  1.44879317,
  2.11558294
];
const timeData = [
  ['2009', '45'],
  ['2009', '46'],
  ['2009', '47'],
  ['2009', '48'],
  ['2009', '49'],
  ['2009', '50'],
  ['2009', '51'],
  ['2009', '52'],
  ['2010', '1'],
  ['2010', '10'],
  ['2010', '11'],
  ['2010', '12'],
  ['2010', '13'],
  ['2010', '14'],
  ['2010', '15'],
  ['2010', '16'],
  ['2010', '17'],
  ['2010', '18'],
  ['2010', '19'],
  ['2010', '2'],
  ['2010', '20'],
  ['2010', '21'],
  ['2010', '23'],
  ['2010', '24'],
  ['2010', '25'],
  ['2010', '26'],
  ['2010', '27'],
  ['2010', '28'],
  ['2010', '29'],
  ['2010', '3'],
  ['2010', '30'],
  ['2010', '31'],
  ['2010', '32'],
  ['2010', '33'],
  ['2010', '34'],
  ['2010', '35'],
  ['2010', '36'],
  ['2010', '37'],
  ['2010', '38'],
  ['2010', '39'],
  ['2010', '4'],
  ['2010', '40'],
  ['2010', '41'],
  ['2010', '42'],
  ['2010', '43'],
  ['2010', '44'],
  ['2010', '45'],
  ['2010', '46'],
  ['2010', '47'],
  ['2010', '48'],
  ['2010', '49'],
  ['2010', '5'],
  ['2010', '50'],
  ['2010', '51'],
  ['2010', '52'],
  ['2010', '6']
];
